* Atlas

The personal kanban/gtd and stat-tracking system.

** Kanban columns
Backlog
Doing
Q/A
Done

Tag Bar holds tags that show color based on how close to goal.

Project => Task  => Actions
The cards represent tasks
The tags represent projects

Tasks need not have an action; if none is present then the task
is assumed to have one implicit action.

* Minimum Viable Product

** Basic Task creation
*** Build a form for a task
    CLOCK: [2014-12-29 Mon 16:43]--[2014-12-29 Mon 16:59] =>  0:16
    CLOCK: [2014-12-28 Sun 18:30]--[2014-12-28 Sun 19:13] =>  0:43
    CLOCK: [2014-12-28 Sun 18:28]--[2014-12-28 Sun 18:30] =>  0:02
1h

*** Write the css for a task
.25h

** Get Kanban columns working
*** Create some views for the columns, see about keeping it DRY
    CLOCK: [2014-12-29 Mon 22:31]--[2014-12-29 Mon 22:48] =>  0:17
    CLOCK: [2014-12-29 Mon 21:39]--[2014-12-29 Mon 21:43] =>  0:04
    CLOCK: [2014-12-29 Mon 20:54]--[2014-12-29 Mon 21:20] =>  0:26
    CLOCK: [2014-12-29 Mon 19:20]--[2014-12-29 Mon 19:28] =>  0:08
    CLOCK: [2014-12-29 Mon 18:53]--[2014-12-29 Mon 19:09] =>  0:16
    CLOCK: [2014-12-29 Mon 17:00]--[2014-12-29 Mon 17:30] =>  0:30
    CLOCK: [2014-12-28 Sun 20:01]--[2014-12-28 Sun 20:14] =>  0:13
2h

Looks like I might have to change my html templating solution
away from mustache.js. I'm getting the feeling that it is not
powerful enough for what I want to do.

** Get change monitoring working
   CLOCK: [2014-12-30 Tue 00:56]--[2014-12-30 Tue 00:58] =>  0:02
   CLOCK: [2014-12-30 Tue 00:53]--[2014-12-30 Tue 00:56] =>  0:03
0.5h

** Add some arrows to get the cards to move from column to column
   CLOCK: [2014-12-30 Tue 09:05]
   CLOCK: [2014-12-30 Tue 01:01]--[2014-12-30 Tue 01:14] =>  0:13
1h

*** Add in drag'n'drop support

** Make login required / Figure out database security
1.5h

* Extras

** Encryption






